# FabricWireItem Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricWireItem Members
FabricWireItem Class Methods Properties See Also
---
The FabricWireItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a single Fabric wire. |
| Dispose | Releases all resources used by the FabricWireItem |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Distance | Distance to the next fabric wire item Can be 0 to be used with offset along wire. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OffsetAlongWire | Offset along wire direction Wire distance should be 0 if we want to be along the same wire |
| WireLength | Wire length for this wire item |
| WireType | The wire type of this wire item |

# See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace